---
kind: property
id: P:Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves.ParameterOnFirstCurve
source: html/224787ac-9ec0-d2f0-e4ca-e58e30027f1a.htm
---
# Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves.ParameterOnFirstCurve Property

1d raw (not normalized) parameter of the point on the first curve.

## Syntax (C#)
```csharp
public double ParameterOnFirstCurve { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The property has not been set by the method providing the result.